app/controllers/tasks_controller.rb

SELECT * FROM "tasks" WHERE ("tasks"."id" = 2)
---
  def show
    @tasks = Task.find(params[:id])

SELECT * FROM "tasks"
---
  def new
  @tasks = Task.all

INSERT INTO "tasks" ("updated_at", "title", "description", "created_at") VALUES('2010-03-19 09:58:06', 'UdaÅ‚o siÄ™', '', '2010-03-19 09:58:06')
---
    task = Task.new(params[:task])
    task.save